import { IPosTypes } from 'types/weather'

export const baseballStadiums: IPosTypes[] = [
  // 위도, 경도순
  {
    title: '잠실야구장',
    region: '잠실',
    lat: 37.51215408798225,
    lng: 127.07190272334536,
    latlng: [37.51215408798225, 127.07190272334536],
  },
  {
    title: '수원KT위즈파크',
    region: '수원',
    lat: 37.2997307041881,
    lng: 127.0097675344297,
    latlng: [37.2997307041881, 127.0097675344297],
  },
  {
    title: '부산사직야구장',
    region: '부산',
    lat: 35.19402896802593,
    lng: 129.06153607572057,
    latlng: [35.19402896802593, 129.06153607572057],
  },
  {
    title: '대전한화생명이글스파크',
    region: '대전',
    lat: 36.317071430292565,
    lng: 127.42916813468256,
    latlng: [36.317071430292565, 127.42916813468256],
  },
  {
    title: '광주기아챔피언스필드',
    region: '광주',
    lat: 35.16820695865543,
    lng: 126.88910108777702,
    latlng: [35.16820695865543, 126.88910108777702],
  },
  {
    title: '고척스카이돔',
    region: '고척',
    lat: 37.498221217691025,
    lng: 126.86708895193757,
    latlng: [37.498221217691025, 126.86708895193757],
  },
  {
    title: '대구삼성라이온즈파크',
    region: '대구',
    lat: 35.841059221219126,
    lng: 128.681651694041,
    latlng: [35.841059221219126, 128.681651694041],
  },
  {
    title: '인천SSG 랜더스필드',
    region: '인천',
    lat: 37.43699867078143,
    lng: 126.69327047487718,
    latlng: [37.43699867078143, 126.69327047487718],
  },
  {
    title: '창원NC파크',
    region: '창원',
    lat: 35.22242560607057,
    lng: 128.58208865536974,
    latlng: [35.22242560607057, 128.58208865536974],
  },
]
